{
    "name": "PURR",
    "description": "<b>PURR</b><br><br>The unresolved self-shielding data generated by UNRESR are suitable for use in multigroup methods after processing by GROUPR, but the so-called Bondarenko method is not very useful for continuous-energy Monte Carlo codes like MCNP.<br>As pointed out, the natural approach for treating unresolved-resonance self-shielding for Monte Carlo codes is the 'Probability Table' method.<br>The method requires tables of the probability that the total cross section will be less than some value &sigma;<sub>t</sub> for a number of incident energies.<br>Then, when the Monte Carlo code needs the cross section at E, it selects a random number between 0 and 1 and looks up the corresponding &sigma;<sub>t</sub> in the appropriate probability table.<br>The corresponding capture and fission cross sections are obtained from conditional probability tables that give &sigma;<sub>&gamma;</sub> and &sigma;<sub>f</sub> versus &sigma;<sub>t</sub>.<br>This approach allows geometry and mix effects on self-shielding to arise naturally during the Monte Carlo calculation, and it supplies reasonable variances for the tallies.<br>The probability table method has been used successfully in a number of applications, notably the VIM continuous-energy Monte Carlo code, which was developed to solve fast-reactor problems where unresolved effects become very important.<br><br>The PURR module produces probability tables that can be used in versions of MCNP from 4B on to treat unresolved-resonance self-shielding.<br>In recent versions of NJOY, the Bondarenko self-shielded cross sections from PURR will override any previous self-shielded data on the PENDF file coming from UNRESR.",
    "tooltip": "Produce probability tables for unresolved-resonance self-shielding.",
    "cards": [
      {
        "name": "Mandatory",
        "parameters": [
          {
            "name": "nendf",
            "display_name": "endf input tape",
            "type": "int",
            "default": -30,
            "constraints": {
              "min": -99,
              "max": 99
            },
            "help": "<b>'nendf'</b><br><br>Unit for endf tape."
          },
          {
            "name": "nin",
            "display_name": "pendf input tape",
            "type": "int",
            "default": -22,
            "constraints": {
              "min": -99,
              "max": 99
            },
            "help": "<b>'nin'</b><br><br>Unit for input pendf tape."
          },
          {
            "name": "nout",
            "display_name": "pendf output tape",
            "type": "int",
            "default": -23,
            "constraints": {
              "min": -99,
              "max": 99
            },
            "help": "<b>'nout'</b><br><br>Unit for output pendf tape."
          },
          {
            "name": "matd",
            "display_name": "Isotope",
            "type": "isotope",
            "default": "U235",
            "help": "<b>'matd'</b><br><br>Material to be processed. Select the isotope and the MAT number will be chosen automatically."
          },
          {
            "name": "temp",
            "display_name": "Temperature",
            "type": "multi",
            "default": 293.6,
            "constraints": {
            "min": 0.0
            },
            "help": "<b>'temp'</b><br><br>Temperatures in Kelvin (including zero)."
          }
        ]
      },
      {
        "name": "Automatic",
        "parameters": [
          {
            "name": "ntemp",
            "default": 1,
            "type": "auto"
          }
        ]
      }
    ]
}
